
### :robot: Terraform Report
---
##### Plan: `11` to add, `0` to change, `0` to destroy

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.github_oidc["github-action"].google_iam_workload_identity_pool.pool will be created
  + resource "google_iam_workload_identity_pool" "pool" {
      + description               = "Workload Identity Pool for github-action"
      + disabled                  = false
      + display_name              = "github-action-pool"
      + id                        = (known after apply)
      + name                      = (known after apply)
      + project                   = "585501833219"
      + state                     = (known after apply)
      + workload_identity_pool_id = "github-action"
    }

  # module.github_oidc["github-action"].google_iam_workload_identity_pool_provider.provider will be created
  + resource "google_iam_workload_identity_pool_provider" "provider" {
      + attribute_mapping                  = {
          + "attribute.actor"      = "assertion.actor"
          + "attribute.aud"        = "assertion.aud"
          + "attribute.ref"        = "assertion.ref"
          + "attribute.repository" = "assertion.repository"
          + "google.subject"       = "assertion.sub"
        }
      + description                        = "Workload Identity Pool Provider for github-action-provider"
      + display_name                       = "github-action-provider"
      + id                                 = (known after apply)
      + name                               = (known after apply)
      + project                            = "585501833219"
      + state                              = (known after apply)
      + workload_identity_pool_id          = "github-action"
      + workload_identity_pool_provider_id = "github-action-provider"

      + oidc {
          + allowed_audiences = []
          + issuer_uri        = "https://token.actions.githubusercontent.com"
        }
    }

  # module.github_oidc["github-action"].google_project_iam_member.sa["roles/editor"] will be created
  + resource "google_project_iam_member" "sa" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "585501833219"
      + role    = "roles/editor"
    }

  # module.github_oidc["github-action"].google_project_iam_member.sa["roles/iam.workloadIdentityUser"] will be created
  + resource "google_project_iam_member" "sa" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "585501833219"
      + role    = "roles/iam.workloadIdentityUser"
    }

  # module.github_oidc["github-action"].google_project_service.service["cloudresourcemanager.googleapis.com"] will be created
  + resource "google_project_service" "service" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "585501833219"
      + service                    = "cloudresourcemanager.googleapis.com"
    }

  # module.github_oidc["github-action"].google_project_service.service["iam.googleapis.com"] will be created
  + resource "google_project_service" "service" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "585501833219"
      + service                    = "iam.googleapis.com"
    }

  # module.github_oidc["github-action"].google_project_service.service["iamcredentials.googleapis.com"] will be created
  + resource "google_project_service" "service" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "585501833219"
      + service                    = "iamcredentials.googleapis.com"
    }

  # module.github_oidc["github-action"].google_project_service.service["sts.googleapis.com"] will be created
  + resource "google_project_service" "service" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "585501833219"
      + service                    = "sts.googleapis.com"
    }

  # module.github_oidc["github-action"].google_service_account.sa will be created
  + resource "google_service_account" "sa" {
      + account_id   = "github-action"
      + description  = "Service account used by github-action"
      + disabled     = false
      + display_name = "github-action"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "585501833219"
      + unique_id    = (known after apply)
    }

  # module.github_oidc["github-action"].google_service_account_iam_member.principal["python-example"] will be created
  + resource "google_service_account_iam_member" "principal" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # module.github_oidc["github-action"].google_service_account_iam_member.sa["ladiesdiv"] will be created
  + resource "google_service_account_iam_member" "sa" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

Plan: 11 to add, 0 to change, 0 to destroy.

```
</details>


---
> This comment was generated by [Terraform Pull Request Report Generator](https://github.com/ahmadnassri/action-terraform-report) - action run [`#10791846453`](https://github.com/LADIESDIV/tf-example/actions/runs/10791846453) - commit 3129b8b44c6f68e4996394bad2e90600e54b74ca
